<table width="900"><td class="pcontent"><center><h3>1074：津津的储蓄计划</h3><br/><font size="2">时间限制: 1000 ms         内存限制: 65536 KB<br/>提交数: 12958     通过数: 6256 </font><br/></center><font size="2"><h3>【题目描述】</h3>
<p> 津津的零花钱一直都是自己管理。每个月的月初妈妈给津津300元钱，津津会预算这个月的花销，并且总能做到实际花销和预算的相同。</p><p>
    为了让津津学习如何储蓄，妈妈提出，津津可以随时把整百的钱存在她那里，到了年末她会加上20％还给津津。因此津津制定了一个储蓄计划：每个月的月初，在得到妈妈给的零花钱后，如果她预计到这个月的月末手中还会有多于100元或恰好100元，她就会把整百的钱存在妈妈那里，剩余的钱留在自己手中。</p><p>
    例如11月初津津手中还有83元，妈妈给了津津300元。津津预计11月的花销是180元，那么她就会在妈妈那里存200元，自己留下183元。到了11月月末，津津手中会剩下3元钱。</p><p>
    现在请你根据2004年1月到12月每个月津津的预算，判断会不会出现这种情况。如果不会，计算到2004年年末，妈妈将津津平常存的钱加上20％还给津津之后，津津手中会有多少钱。 </p><p>
</p>
<h3>【输入】</h3>
<p> 包括12行数据，每行包含一个小于350的非负整数，分别表示1月到12月津津的预算。 </p>
<h3>【输出】</h3>
<p> 只包含一个整数。如果储蓄计划实施过程中出现某个月钱不够用的情况，输出-X，X表示出现这种情况的第一个月；否则输出到2004年年末津津手中会有多少钱。</p>
<h3>【输入样例】</h3>
<font size="3"><div style="padding-left:24px;"><pre>290
230
280
200
300
170
340
50 
90 
80 
200
60</pre></div>
<font size="2"><h3>【输出样例】</h3>
<font size="3"><div style="padding-left:24px;"><pre>-7</pre></div><font size="2"><h3>【提示】</h3><p>【[样例2】</p><p>
输入：</p><p>
290 </p><p>
230 </p><p>
280 </p><p>
200 </p><p>
300 </p><p>
170 </p><p>
330 </p><p>
50 </p><p>
90 </p><p>
80 </p><p>
200 </p><p>
60</p><p>
</p><p>
输出：</p><p>
1580</p>
<h3>【来源】</h3><br/><font size="2"><a class="bottom_link" href="problem_search.php?searchsource=NO">NO</a><p align="center"> <a class="bottom_link" href="submit.php?pid=1074"> 提交 </a> <a class="bottom_link" href="problem_stat.php?pid=1074"> 统计信息 </a> </p></font></font></font></font></font></font></td></table>