<table width="900"><td class="pcontent"><center><h3>1251：仙岛求药</h3><br/><font size="2">时间限制: 1000 ms         内存限制: 65536 KB<br/>提交数: 3035     通过数: 1315 </font><br/></center><font size="2"><h3>【题目描述】</h3>
<p>少年李逍遥的婶婶病了，王小虎介绍他去一趟仙灵岛，向仙女姐姐要仙丹救婶婶。叛逆但孝顺的李逍遥闯进了仙灵岛，克服了千险万难来到岛的中心，发现仙药摆在了迷阵的深处。迷阵由M×N个方格组成，有的方格内有可以瞬秒李逍遥的怪物，而有的方格内则是安全。现在李逍遥想尽快找到仙药，显然他应避开有怪物的方格，并经过最少的方格，而且那里会有神秘人物等待着他。现在要求你来帮助他实现这个目标。</p><p>
下图 显示了一个迷阵的样例及李逍遥找到仙药的路线。</p><p>
<img src="pic/1251.gif"/></p>
<h3>【输入】</h3>
<p>输入有多组测试数据. 每组测试数据以两个非零整数 M 和 N 开始，两者均不大于20。M 表示迷阵行数, N 表示迷阵列数。接下来有 M 行, 每行包含N个字符,不同字符分别代表不同含义: </p><p>
1)‘@’：少年李逍遥所在的位置；</p><p>
2)‘.’：可以安全通行的方格；</p><p>
3)‘#’：有怪物的方格；</p><p>
4)‘*’：仙药所在位置。</p><p>
当在一行中读入的是两个零时，表示输入结束。</p><p>
</p>
<h3>【输出】</h3>
<p>对于每组测试数据，分别输出一行，该行包含李逍遥找到仙药需要穿过的最少的方格数目(计数包括初始位置的方块)。如果他不可能找到仙药, 则输出 -1。</p>
<h3>【输入样例】</h3>
<font size="3"><div style="padding-left:24px;"><pre>8 8
.@##...#
#....#.#
#.#.##..
..#.###.
#.#...#.
..###.#.
...#.*..
.#...###
6 5
.*.#.
.#...
..##.
.....
.#...
....@
9 6

.#..#.
.#.*.#
.####.
..#...
..#...
..#...
..#...
#.@.##
.#..#.
0 0</pre></div>
<font size="2"><h3>【输出样例】</h3>
<font size="3"><div style="padding-left:24px;"><pre>10
8
-1</pre></div><font size="2"><h3>【来源】</h3><br/><font size="2"><a class="bottom_link" href="problem_search.php?searchsource=No">No</a><p align="center"> <a class="bottom_link" href="submit.php?pid=1251"> 提交 </a> <a class="bottom_link" href="problem_stat.php?pid=1251"> 统计信息 </a> </p></font></font></font></font></font></font></td></table>